# BuiltInFailures.CuttingFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CuttingFailures Class
BuiltInFailures Class Members See Also
---
Failures about Cutting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CuttingFailures
```

Visual Basic
---
```text
Public NotInheritable Class CuttingFailures
```

Visual C++
---
```text
public ref class CuttingFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CuttingFailures
# See Also
BuiltInFailures..::..CuttingFailures Members
Autodesk.Revit.DB Namespace